Show / Hide Table of Contents
Class LineSupportSegment
Line support on segment
Inheritance
System.Object
OpenObject
OpenElementId
LineSupportSegment
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Model
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Structure.LineSupportSegment,CI.StructuralElements", "CI.StructModel.Structure.ILineSupportSegment,CI.BasicTypes")]
public class LineSupportSegment : OpenElementId
Properties
Improve this Doc   View Source
FlexibleStiffnessRX
Support stiffness rotational RX
Declaration
public double FlexibleStiffnessRX { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
FlexibleStiffnessRY
Support stiffness rotational RY
Declaration
public double FlexibleStiffnessRY { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
FlexibleStiffnessRZ
Support stiffness rotational RZ
Declaration
public double FlexibleStiffnessRZ { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
FlexibleStiffnessX
Support stiffness X dirrection
Declaration
public double FlexibleStiffnessX { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
FlexibleStiffnessY
Support stiffness Y dirrection
Declaration
public double FlexibleStiffnessY { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
FlexibleStiffnessZ
Support stiffness Z dirrection
Declaration
public double FlexibleStiffnessZ { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
LocalCoordinateSystem
Support local coord system
Declaration
public CoordSystem LocalCoordinateSystem { get; set; }
Property Value
 Type |  Description
 CoordSystem
Improve this Doc   View Source
Segment
Reference to geometrical segment3D
Declaration
[OpenModelProperty("GeoSegment")]
public ReferenceElement Segment { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
SupportTypeRX
Support type in dirrection round X
Declaration
public SupportTypeInDirrection SupportTypeRX { get; set; }
Property Value
 Type |  Description
 SupportTypeInDirrection
Improve this Doc   View Source
SupportTypeRY
Support type in dirrection round Y
Declaration
public SupportTypeInDirrection SupportTypeRY { get; set; }
Property Value
 Type |  Description
 SupportTypeInDirrection
Improve this Doc   View Source
SupportTypeRZ
Support type in dirrection round Z
Declaration
public SupportTypeInDirrection SupportTypeRZ { get; set; }
Property Value
 Type |  Description
 SupportTypeInDirrection
Improve this Doc   View Source
SupportTypeX
Support type in dirrection X
Declaration
public SupportTypeInDirrection SupportTypeX { get; set; }
Property Value
 Type |  Description
 SupportTypeInDirrection
Improve this Doc   View Source
SupportTypeY
Support type in dirrection Y
Declaration
public SupportTypeInDirrection SupportTypeY { get; set; }
Property Value
 Type |  Description
 SupportTypeInDirrection
Improve this Doc   View Source
SupportTypeZ
Support type in dirrection Z
Declaration
public SupportTypeInDirrection SupportTypeZ { get; set; }
Property Value
 Type |  Description
 SupportTypeInDirrection
 Improve this Doc
 View Source